Autodesk.Navisworks.Api.GroupItem
Base class for classes which contain a collection of saved items.

Autodesk.Navisworks.Api.GroupItem.Children
Children of the group

Autodesk.Navisworks.Api.GroupItem.CreateCopyWithoutChildren
Create a new copy of this item without its child-items
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.GroupItem.IsReadOnly
Gets a value indicating whether the object is read-only.